#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//1.算术操作符
//+ - * / %

//2.移位操作符
//移动的是二进制位，其操作数只能是整数
//整数的二进制表示的3种方法：原码，反码，补码

//正整数的原码，反码，补码相同
//负整数的原码，反码，补码需要计算

//7
//00000000000000000000000000000111 - 原码，反码，补码
//最高位是符号位，0表示是正整数，1则为负整数

//-7
//10000000000000000000000000000111 - 原码（按内容直接写出）
//11111111111111111111111111111000 - 反码（最高位符号不变，其它位按位取反就是反码）
//11111111111111111111111111111001 - 补码（反码+1就是补码）

//整数在内存中存储的是补码，但是打印是按照原码

//左移操作符：左边丢弃，右边补0；
//00000000000000000000000000000111 - 7的补码
//0000000000000000000000000000111 - 左移，丢弃一个0
//00000000000000000000000000001110 -右边再补一个0，正整数补码和原码一致，得到14

//11111111111111111111111111111001 - -7的补码
//1111111111111111111111111111001 - 左移，丢弃一个1
//11111111111111111111111111110010 - 右边再补一个0，该结果为负整数补码
//11111111111111111111111111110001 - 补码-1得到反码
//10000000000000000000000000001110 - 最高位不变，由反码得到原码，得到-14

//右移操作符：
//算术移位：右边丢弃，左边补原符号位
//逻辑移位：右边丢弃，左边补0

int main()
{
	int a = -7;
	int b = a << 1;
	printf("a=%d\n", a);//移位操作不会改变a本身的值
	printf("b=%d\n", b);
	return 0;
}
