#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//1.算术操作符
//+ - * / %

//2.移位操作符
//移动的是二进制位，其操作数只能是整数
//整数的二进制表示的3种方法：原码，反码，补码

//正整数的原码，反码，补码相同
//负整数的原码，反码，补码需要计算

//7
//00000000000000000000000000000111 - 原码，反码，补码
//最高位是符号位，0表示是正整数，1则为负整数

//-7
//10000000000000000000000000000111 - 原码（按内容直接写出）
//11111111111111111111111111111000 - 反码（最高位符号不变，其它位按位取反就是反码）
//11111111111111111111111111111001 - 补码（反码+1就是补码）

//整数在内存中存储的是补码，但是打印是按照原码

//左移操作符：左边丢弃，右边补0；
//00000000000000000000000000000111 - 7的补码
//0000000000000000000000000000111 - 左移，丢弃一个0
//00000000000000000000000000001110 -右边再补一个0，正整数补码和原码一致，得到14

//11111111111111111111111111111001 - -7的补码
//1111111111111111111111111111001 - 左移，丢弃一个1
//11111111111111111111111111110010 - 右边再补一个0，该结果为负整数补码
//11111111111111111111111111110001 - 补码-1得到反码
//10000000000000000000000000001110 - 最高位不变，由反码得到原码，得到-14

//右移操作符：
//算术移位：右边丢弃，左边补原符号位
//逻辑移位：右边丢弃，左边补0
//取决于编译器
//
//11111111111111111111111111111001 - -7的补码
// 1111111111111111111111111111100 - 右移，丢弃一个1
//11111111111111111111111111111100 - 左边按算术移位补原符号
//11111111111111111111111111111011 - 减1得到反码
//10000000000000000000000000000100 - 由反码得到原码，-4
//
// 
//int main()
//{
//	int a = -7;
//	int b = a << 1;
//	printf("a=%d\n", a);//移位操作不会改变a本身的值
//	printf("b=%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = -7;
//	int b = a >> 1;
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	return 0;
//}

//3.位操作符

// & 按（2进制）位与
// 00000000000000000000000000000011 - 3的补码
// 11111111111111111111111111111011 - -5的补码
// 相同取同，异则取0
// 00000000000000000000000000000011 - 按位与结果码

// | 按（2进制）位或
// 00000000000000000000000000000011 - 3的补码
// 11111111111111111111111111111011 - -5的补码
// 有1取1，双0为0
// 11111111111111111111111111111011 - 按位或结果补码
// 10000000000000000000000000000101 - 原码，-5

// ^ 按（2进制）位异或
// 00000000000000000000000000000011 - 3的补码
// 11111111111111111111111111111011 - -5的补码
// 相同为0，相异为1
// 11111111111111111111111111111000 - 按位异或补码
// 10000000000000000000000000001000 - 原码，-8

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b;
//	int d = a | b;
//	int e = a ^ b;
//	printf("c=%d\n", c);
//	printf("d=%d\n", d);
//	printf("e=%d\n", e);
//	return 0;
//}

//不创建临时变量，交换两个整数内容
//按位异或的规律
//3^3 -->a^a=0
//011
//011
//000 - 0

//0^5 -->0^a=a
//000
//101
//101 - 5

//3^5^3 -->满足交换律
//011
//101
//110
//011
//101 - 5

//局限性：小数不能使用，运算没有创建临时变量快

//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("a=%d ", a);
//	printf("b=%d\n", b);
//	a = a ^ b;//3^5
//	b = a ^ b;//3^5^5=3
//	a = a ^ b;//3^5^3=5
//	printf("a=%d ", a);
//	printf("b=%d\n", b);
//	return 0;
//}

//求一个整数存储在内存中的二进制1的个数

//a=3
//00000000000000000000000000000011

//a&1
//00000000000000000000000000000011
//00000000000000000000000000000001
//00000000000000000000000000000001 - 结果

//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	int i = 0;
//	int c = 0;
//	for (i = 0; i < 32; i++)
//	{
//		c += a & 1;
//		a = a >> 1;
//	}
//	printf("%d\n", c);
//	return 0;
//}

//4.赋值操作符
//连续赋值

//int main()
//{
//	int a = 10;
//	int b = 0;
//	int c = 20;
//	a = b= c - 2;
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}

//5.单目操作符
// ~ 按（二进制）位取反
//00000000000000000000000000000000 - 0补码
//11111111111111111111111111111111 - 取反补码
//10000000000000000000000000000001 - 求得原码，-1

//int main()
//{
//	int a = 0;
//	printf("%d\n", ~a);
//	return 0;
//}

//实现对二进制的修改
//int main()
//{
//	int a = 13;
	//00000000000000000000000000001101 - 把倒数第二个0改为1
	//00000000000000000000000000000010 - 按位或上1<<1
	//a |= 1 << 1;
	//printf("%d\n", a);

	//00000000000000000000000000001101 - 把倒数第二个1改为0
	//11111111111111111111111111111011 - 按位与上此补码
	//得来的方式：
	//1<<2
	//00000000000000000000000000000100
	//按位取反~
	//11111111111111111111111111111011
	/*a &= ~(1 << 2);
	printf("%d\n", a);
	return 0;
}*/

//int main()
//{
//	int a = 10;
//	printf("%d\n", a--);
//	printf("%d\n", a);
//	test(a--);//传参也是先使用，后--
//	return 0;
//}

//int main()
//{
//	printf("%d\n", !9);
//	return 0;
//}

//sizeof知识点
void test1(int arr[])
{
	printf("(2)%zu\n", sizeof(arr));
}
void test2(char ch[])
{
	printf("(4)%zu\n", sizeof(ch));
}
int main()
{
	int arr[10] = { 0 };
	char ch[10] = { 0 };
	printf("(1)%zu\n", sizeof(arr));
	printf("(3)%zu\n", sizeof(ch));
	test1(arr);
	test2(ch);
	return 0;
}